---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.Insert(Autodesk.Revit.DB.Category)
source: html/bc542c5d-a5a2-76b4-b58c-14e885fe76a5.htm
---
# Autodesk.Revit.DB.CategorySet.Insert Method

Insert the specified category into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	Category item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Category`) - The item to be inserted into the set.

## Returns
Returns whether the item was inserted into the set.